1. ¿qué diferencia hay entre una seri y un DataFrame?

En resumen, una Serie es una estructura de datos unidimensional que representa una columna de datos, mientras que un DataFrame es una estructura de datos bidimensional que representa una tabla de datos con filas y columnas. Los DataFrames son más versátiles y generalmente se utilizan para manipular y analizar conjuntos de datos más complejos, mientras que las Series son útiles para operaciones más simples en datos unidimensionales.

In [23]:
import numpy as np
import random
import pandas as pd

2.	Momento de trabajar con Series. Contesta a las siguientes preguntas:
o	Crea dos listas: Una que se llame "valores" que tenga 7 números aleatorios.
Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [24]:
# Crear una lista con 7 números aleatorios
numeros_aleatorios = random.sample(range(1, 101), 7)

# Mostrar la lista de números aleatorios
print(numeros_aleatorios)

indices = ['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado', 'Domingo']

[9, 1, 78, 58, 40, 93, 19]

- A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.
serie = pd.Series(valores, index=indices)

In [25]:
serie = pd.Series(numeros_aleatorios, index=indices)

In [26]:
serie

Lunes         9
Martes        1
Miércoles    78
Jueves       58
Viernes      40
Sábado       93
Domingo      19
dtype: int64

- A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí

In [27]:
diccionario = {}
for index,valor in zip(indices, numeros_aleatorios):
    diccionario[index] = valor

In [28]:
print(diccionario)

{'Lunes': 9, 'Martes': 1, 'Miércoles': 78, 'Jueves': 58, 'Viernes': 40, 'Sábado': 93, 'Domingo': 19}

- Crea una Serie con el diccionario creado en el punto anterior.

In [29]:
Serie1 =pd.Series(diccionario)
Serie1

Lunes         9
Martes        1
Miércoles    78
Jueves       58
Viernes      40
Sábado       93
Domingo      19
dtype: int64

- ¿Qué forma tiene esta última Serie?

In [30]:
Serie1.shape

(7,)

- ¿Qué tipo de datos tiene?
- ¿Qué tamaño tiene?
- ¿Cuáles son los índices de la Serie?
- ¿Y los values?

In [31]:
Serie1.dtype

dtype('int64')

In [32]:
Serie1.size

7

In [33]:
Serie1.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

In [34]:
Serie1.values

array([ 9,  1, 78, 58, 40, 93, 19])

- Extrae el valor para el índice "lunes"
- Extrae el valor para el índice "lunes", "martes" y "miércoles".
- Extrae el valor para el índice "lunes" y "domingo".

In [35]:
Serie1['Lunes']

9

In [36]:
# Extrae el valor para el índice "lunes"
Serie1[0]

9

In [37]:
# Extrae el valor para el índice "lunes", "martes" y "miércoles".
Serie1[0:3]

Lunes         9
Martes        1
Miércoles    78
dtype: int64

In [38]:
# Extrae el valor para el índice "lunes" y "domingo".
Serie1[[0,6]]

Lunes       9
Domingo    19
dtype: int64

3.	Es el turno de los DataFrames
o	Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [39]:
array1 =np.random.randint(1,100,(4,3))

In [40]:
array1

array([[28, 73, 25],
       [25, 43, 47],
       [39, 61, 74],
       [87, 32, 72]])

- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [41]:
df =pd.DataFrame(array1, columns =["España", "Francia", "Italia"])

In [42]:
df

   España  Francia  Italia
0      28       73      25
1      25       43      47
2      39       61      74
3      87       32      72

- Descarga el archivo "medallas" y carga el DataFrame.

In [43]:
df =pd.read_csv("files/medallas.csv")
df.head()

   Unnamed: 0           País   Oro  Plata  Bronce
0           1          China  1473    994     720
1           2          Japón  1032   1037     985
2           3  Corea del Sur   745    663     827
3           4           Irán   179    181     197
4           5     Kazajistán   155    158     224


-   Usando el loc extrae todas las columnas de la fila de Tailandia.
-   Usando el loc extrae todas las columnas de China e Irán.
-   Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
-   Usando el iloc extrae la información de la India. Devolved todas las columnas.
-   Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
-   Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [44]:
# Usando el loc extrae todas las columnas de la fila de Tailandia.


df.loc[:, "País"]

0              China
1              Japón
2      Corea del Sur
3               Irán
4         Kazajistán
5              India
6          Tailandia
7          Indonesia
8       China Taipéi
9    Corea del Norte
Name: País, dtype: object

In [45]:
df.loc[6,:]

Unnamed: 0            7
País          Tailandia
Oro                 132
Plata               175
Bronce              278
Name: 6, dtype: object

In [46]:
# Usando el loc extrae todas las columnas de China e Irán.
df.loc[[3,8],:]

   Unnamed: 0          País  Oro  Plata  Bronce
3           4          Irán  179    181     197
8           9  China Taipéi   99    144     276

In [47]:
# Usando el iloc extrae la información de la India. Devolved todas las columnas.
df.iloc[5, :]

Unnamed: 0        6
País          India
Oro             154
Plata           202
Bronce          315
Name: 5, dtype: object

In [48]:
# Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
df.iloc[1::2, :]

   Unnamed: 0             País   Oro  Plata  Bronce
1           2            Japón  1032   1037     985
3           4             Irán   179    181     197
5           6            India   154    202     315
7           8        Indonesia   112    131     240
9          10  Corea del Norte    91    120     235

In [49]:
# Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".
df.iloc[1::2, 2:5]
df.iloc[1::2, [2,3,4]]

    Oro  Plata  Bronce
1  1032   1037     985
3   179    181     197
5   154    202     315
7   112    131     240
9    91    120     235

- Contesta a las siguientes preguntas:

        - ¿Qué país consiguió más de 200 medallas de oro?
        - ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
        - ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [50]:
# ¿Qué país consiguió más de 200 medallas de oro?
(df["Oro"] > 200)

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Oro, dtype: bool

In [51]:
df.loc[(df["Oro"] > 200) ]

   Unnamed: 0           País   Oro  Plata  Bronce
0           1          China  1473    994     720
1           2          Japón  1032   1037     985
2           3  Corea del Sur   745    663     827

In [52]:
# 	¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
(df["Oro"] > 200) 
(df["Plata"]>1000)
df.loc[(df["Oro"] > 200) & (df["Plata"]>1000), : ]

   Unnamed: 0   País   Oro  Plata  Bronce
1           2  Japón  1032   1037     985

In [53]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [54]:
(df["Oro"] > 200) 
(df["Bronce"]>700)
df.loc[(df["Oro"] > 200) | (df["Bronce"]>700), : ]

   Unnamed: 0           País   Oro  Plata  Bronce
0           1          China  1473    994     720
1           2          Japón  1032   1037     985
2           3  Corea del Sur   745    663     827

- Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [55]:
df["Total"] = df["Oro"] + df["Plata"] + df["Bronce"]

In [56]:
df

   Unnamed: 0             País   Oro  Plata  Bronce  Total
0           1            China  1473    994     720   3187
1           2            Japón  1032   1037     985   3054
2           3    Corea del Sur   745    663     827   2235
3           4             Irán   179    181     197    557
4           5       Kazajistán   155    158     224    537
5           6            India   154    202     315    671
6           7        Tailandia   132    175     278    585
7           8        Indonesia   112    131     240    483
8           9     China Taipéi    99    144     276    519
9          10  Corea del Norte    91    120     235    446